# duplicate removing by row or column

In [2]:
df=DataFrame({'column1':[1,1,2,2,3,3,4,4,5],
             'column2':['a','a','b','b','c','c','d','d','e'],
             'column3':['A','A','B','B','C','C','D','D','E']})
df

   column1 column2 column3
0        1       a       A
1        1       a       A
2        2       b       B
3        2       b       B
4        3       c       C
5        3       c       C
6        4       d       D
7        4       d       D
8        5       e       E

In [3]:
df.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6    False
7     True
8    False
dtype: bool

In [4]:
df.drop_duplicates() # remove duplicate row

   column1 column2 column3
0        1       a       A
2        2       b       B
4        3       c       C
6        4       d       D
8        5       e       E

In [5]:
df

   column1 column2 column3
0        1       a       A
1        1       a       A
2        2       b       B
3        2       b       B
4        3       c       C
5        3       c       C
6        4       d       D
7        4       d       D
8        5       e       E

In [10]:
df.drop_duplicates(['column3'])

   column1 column2 column3
0        1       a       A
2        2       b       B
4        3       c       C
6        4       d       D
8        5       e       E